In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
seri = pd.Series([1,2,3,4,5,6,7,8,9])

In [6]:
type(seri)

pandas.core.series.Series

In [7]:
seri

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [8]:
df= pd.DataFrame(seri, columns=["tablo1"])

In [9]:
df

   tablo1
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8
8       9

In [10]:
l=np.arange(1,10).reshape((3,3))

In [11]:
l

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [12]:
tablo2=pd.DataFrame(l,columns=(["var1","var2","var3"]))

In [13]:
tablo2

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [14]:
type(tablo2)

pandas.core.frame.DataFrame

In [15]:
tablo2.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['var1', 'var2', 'var3'], dtype='object')]

In [16]:
s=["var1","var4","var2"]

In [17]:
for i in s:
    print(i in tablo2)

True
False
True

In [18]:
tablo2["var4"]= tablo2["var1"]/tablo2["var2"]

In [19]:
tablo2

   var1  var2  var3   var4
0     1     2     3  0.500
1     4     5     6  0.800
2     7     8     9  0.875

In [20]:
tablo2.drop(1,axis=0)

   var1  var2  var3   var4
0     1     2     3  0.500
2     7     8     9  0.875

In [21]:
tablo2

   var1  var2  var3   var4
0     1     2     3  0.500
1     4     5     6  0.800
2     7     8     9  0.875

In [22]:
tablo2.drop("var4",axis=1)

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [23]:
tablo2

   var1  var2  var3   var4
0     1     2     3  0.500
1     4     5     6  0.800
2     7     8     9  0.875

In [24]:
tablo2.drop("var4",axis=1,inplace=True) # inplace kalıcı olarak silmeyi sağlıyor.

In [25]:
tablo2

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [31]:
tablo2[0:2]

   var1  var2  var3
0     1     2     3
1     4     5     6

In [30]:
tablo2.loc[0:2]

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [29]:
tablo2.iloc[0:2]

   var1  var2  var3
0     1     2     3
1     4     5     6

In [32]:
tablo2.iloc[:2,:1]

   var1
0     1
1     4

In [38]:
tablo2[tablo2.var1>2]["var1"] #kosullu eleman islemleri

1    4
2    7
Name: var1, dtype: int32

In [42]:
tablo2.loc[(tablo2.var1>3) , ["var1","var2"]]

   var1  var2
1     4     5
2     7     8

In [46]:
m=np.random.randint(1,20 ,size=(5,3))
df1=pd.DataFrame(m, columns=("var1","var2","var3"))   #dataframe birlestirme
df1

   var1  var2  var3
0     8     7    18
1    13    10     6
2    17    13     8
3     7     8     8
4    16     8     1

In [47]:
df2=df1+80

In [48]:
df2

   var1  var2  var3
0    88    87    98
1    93    90    86
2    97    93    88
3    87    88    88
4    96    88    81

In [49]:
pd.concat([df1,df2])  #dataframe birlestirme

   var1  var2  var3
0     8     7    18
1    13    10     6
2    17    13     8
3     7     8     8
4    16     8     1
0    88    87    98
1    93    90    86
2    97    93    88
3    87    88    88
4    96    88    81

In [52]:
pip install seaborn

Collecting seabornNote: you may need to restart the kernel to use updated packages.

  Downloading seaborn-0.11.1-py3-none-any.whl (285 kB)
Requirement already satisfied: matplotlib>=2.2 in c:\users\aslisesli\anaconda3\envs\python\lib\site-packages (from seaborn) (3.3.4)
Requirement already satisfied: numpy>=1.15 in c:\users\aslisesli\anaconda3\envs\python\lib\site-packages (from seaborn) (1.19.5)
Requirement already satisfied: pandas>=0.23 in c:\users\aslisesli\anaconda3\envs\python\lib\site-packages (from seaborn) (1.1.3)
Collecting scipy>=1.0
  Downloading scipy-1.5.4-cp36-cp36m-win_amd64.whl (31.2 MB)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\aslisesli\anaconda3\envs\python\lib\site-packages (from matplotlib>=2.2->seaborn) (1.3.1)
Requirement already satisfied: python-dateutil>=2.1 in c:\users\aslisesli\anaconda3\envs\python\lib\site-packages (from matplotlib>=2.2->seaborn) (2.8.1)
Requirement already satisfied: pillow>=6.2.0 in c:\users\aslisesli\anaconda3\envs\python\lib\site-packages (from matplotlib>=2.2->seaborn) (8.1.0)
Requirement already satisfied: cycler>=0.10 in c:\users\aslisesli\anaconda3\envs\python\lib\site-packages (from matplotlib>=2.2->seaborn) (0.10.0)
Requirement already satisfied: pyparsing!=2.0.4,!=2.1.2,!=2.1.6,>=2.0.3 in c:\users\aslisesli\anaconda3\envs\python\lib\site-packages (from matplotlib>=2.2->seaborn) (2.4.7)
Requirement already satisfied: six in c:\users\aslisesli\anaconda3\envs\python\lib\site-packages (from cycler>=0.10->matplotlib>=2.2->seaborn) (1.15.0)
Requirement already satisfied: pytz>=2017.2 in c:\users\aslisesli\anaconda3\envs\python\lib\site-packages (from pandas>=0.23->seaborn) (2021.1)
Installing collected packages: scipy, seaborn
Successfully installed scipy-1.5.4 seaborn-0.11.1

In [54]:
import seaborn as sns